###################################################################

# Created by write_sdc on Fri Jul 10 05:17:55 2020

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_max_fanout 8 [current_design]
set_max_area 0
set_ideal_network -no_propagate  [get_ports clk]
set_ideal_network -no_propagate  [get_ports rst_x]
create_clock [get_ports clk]  -name clk_ext  -period 20  -waveform {0 10}
set_false_path   -through [list [get_ports rst_x]]
set_input_delay -clock clk_ext  0  [get_ports rst_x]
set_input_delay -clock clk_ext  0  [get_ports {cnt_for_LUT_pos[6]}]
set_input_delay -clock clk_ext  0  [get_ports {cnt_for_LUT_pos[5]}]
set_input_delay -clock clk_ext  0  [get_ports {cnt_for_LUT_pos[4]}]
set_input_delay -clock clk_ext  0  [get_ports {cnt_for_LUT_pos[3]}]
set_input_delay -clock clk_ext  0  [get_ports {cnt_for_LUT_pos[2]}]
set_input_delay -clock clk_ext  0  [get_ports {cnt_for_LUT_pos[1]}]
set_input_delay -clock clk_ext  0  [get_ports {cnt_for_LUT_pos[0]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_0_sign[7]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_0_sign[6]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_0_sign[5]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_0_sign[4]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_0_sign[3]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_0_sign[2]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_0_sign[1]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_0_sign[0]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_1_sign[7]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_1_sign[6]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_1_sign[5]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_1_sign[4]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_1_sign[3]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_1_sign[2]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_1_sign[1]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_1_sign[0]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_2_sign[7]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_2_sign[6]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_2_sign[5]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_2_sign[4]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_2_sign[3]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_2_sign[2]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_2_sign[1]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_2_sign[0]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_3_sign[7]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_3_sign[6]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_3_sign[5]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_3_sign[4]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_3_sign[3]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_3_sign[2]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_3_sign[1]}]
set_input_delay -clock clk_ext  0  [get_ports {vACC_3_sign[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_0[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_0[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_1[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_1[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_2[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_2[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_3[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_3[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_4[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_4[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_5[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_5[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_6[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_6[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_7[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case0_7[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_0[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_0[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_1[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_1[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_2[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_2[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_3[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_3[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_4[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_4[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_5[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_5[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_6[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_6[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_7[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case1_7[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_0[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_0[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_1[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_1[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_2[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_2[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_3[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_3[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_4[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_4[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_5[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_5[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_6[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_6[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_7[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case2_7[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_0[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_0[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_1[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_1[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_2[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_2[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_3[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_3[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_4[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_4[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_5[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_5[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_6[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_6[0]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_7[1]}]
set_input_delay -clock clk_ext  0  [get_ports {lut_result_case3_7[0]}]
set_input_delay -clock clk_ext  0  [get_ports {burst_case[3]}]
set_input_delay -clock clk_ext  0  [get_ports {burst_case[2]}]
set_input_delay -clock clk_ext  0  [get_ports {burst_case[1]}]
set_input_delay -clock clk_ext  0  [get_ports {burst_case[0]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[21]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[20]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[19]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[18]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[17]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[16]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[15]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[14]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[13]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[12]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[11]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[10]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[9]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[8]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[7]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[6]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[5]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[4]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[3]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[2]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[1]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_0[0]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[21]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[20]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[19]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[18]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[17]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[16]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[15]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[14]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[13]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[12]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[11]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[10]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[9]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[8]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[7]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[6]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[5]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[4]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[3]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[2]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[1]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_1[0]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[21]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[20]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[19]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[18]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[17]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[16]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[15]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[14]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[13]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[12]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[11]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[10]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[9]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[8]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[7]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[6]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[5]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[4]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[3]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[2]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[1]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_2[0]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[21]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[20]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[19]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[18]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[17]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[16]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[15]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[14]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[13]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[12]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[11]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[10]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[9]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[8]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[7]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[6]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[5]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[4]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[3]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[2]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[1]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_3[0]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[21]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[20]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[19]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[18]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[17]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[16]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[15]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[14]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[13]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[12]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[11]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[10]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[9]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[8]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[7]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[6]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[5]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[4]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[3]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[2]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[1]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_4[0]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[21]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[20]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[19]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[18]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[17]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[16]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[15]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[14]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[13]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[12]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[11]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[10]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[9]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[8]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[7]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[6]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[5]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[4]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[3]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[2]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[1]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_5[0]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[21]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[20]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[19]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[18]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[17]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[16]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[15]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[14]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[13]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[12]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[11]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[10]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[9]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[8]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[7]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[6]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[5]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[4]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[3]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[2]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[1]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_6[0]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[21]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[20]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[19]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[18]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[17]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[16]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[15]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[14]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[13]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[12]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[11]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[10]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[9]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[8]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[7]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[6]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[5]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[4]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[3]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[2]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[1]}]
set_output_delay -clock clk_ext  0  [get_ports {lut_result_in_7[0]}]
set_input_transition -max 0.5  [get_ports rst_x]
set_input_transition -min 0.5  [get_ports rst_x]
set_input_transition -max 0.5  [get_ports {cnt_for_LUT_pos[6]}]
set_input_transition -min 0.5  [get_ports {cnt_for_LUT_pos[6]}]
set_input_transition -max 0.5  [get_ports {cnt_for_LUT_pos[5]}]
set_input_transition -min 0.5  [get_ports {cnt_for_LUT_pos[5]}]
set_input_transition -max 0.5  [get_ports {cnt_for_LUT_pos[4]}]
set_input_transition -min 0.5  [get_ports {cnt_for_LUT_pos[4]}]
set_input_transition -max 0.5  [get_ports {cnt_for_LUT_pos[3]}]
set_input_transition -min 0.5  [get_ports {cnt_for_LUT_pos[3]}]
set_input_transition -max 0.5  [get_ports {cnt_for_LUT_pos[2]}]
set_input_transition -min 0.5  [get_ports {cnt_for_LUT_pos[2]}]
set_input_transition -max 0.5  [get_ports {cnt_for_LUT_pos[1]}]
set_input_transition -min 0.5  [get_ports {cnt_for_LUT_pos[1]}]
set_input_transition -max 0.5  [get_ports {cnt_for_LUT_pos[0]}]
set_input_transition -min 0.5  [get_ports {cnt_for_LUT_pos[0]}]
set_input_transition -max 0.5  [get_ports {vACC_0_sign[7]}]
set_input_transition -min 0.5  [get_ports {vACC_0_sign[7]}]
set_input_transition -max 0.5  [get_ports {vACC_0_sign[6]}]
set_input_transition -min 0.5  [get_ports {vACC_0_sign[6]}]
set_input_transition -max 0.5  [get_ports {vACC_0_sign[5]}]
set_input_transition -min 0.5  [get_ports {vACC_0_sign[5]}]
set_input_transition -max 0.5  [get_ports {vACC_0_sign[4]}]
set_input_transition -min 0.5  [get_ports {vACC_0_sign[4]}]
set_input_transition -max 0.5  [get_ports {vACC_0_sign[3]}]
set_input_transition -min 0.5  [get_ports {vACC_0_sign[3]}]
set_input_transition -max 0.5  [get_ports {vACC_0_sign[2]}]
set_input_transition -min 0.5  [get_ports {vACC_0_sign[2]}]
set_input_transition -max 0.5  [get_ports {vACC_0_sign[1]}]
set_input_transition -min 0.5  [get_ports {vACC_0_sign[1]}]
set_input_transition -max 0.5  [get_ports {vACC_0_sign[0]}]
set_input_transition -min 0.5  [get_ports {vACC_0_sign[0]}]
set_input_transition -max 0.5  [get_ports {vACC_1_sign[7]}]
set_input_transition -min 0.5  [get_ports {vACC_1_sign[7]}]
set_input_transition -max 0.5  [get_ports {vACC_1_sign[6]}]
set_input_transition -min 0.5  [get_ports {vACC_1_sign[6]}]
set_input_transition -max 0.5  [get_ports {vACC_1_sign[5]}]
set_input_transition -min 0.5  [get_ports {vACC_1_sign[5]}]
set_input_transition -max 0.5  [get_ports {vACC_1_sign[4]}]
set_input_transition -min 0.5  [get_ports {vACC_1_sign[4]}]
set_input_transition -max 0.5  [get_ports {vACC_1_sign[3]}]
set_input_transition -min 0.5  [get_ports {vACC_1_sign[3]}]
set_input_transition -max 0.5  [get_ports {vACC_1_sign[2]}]
set_input_transition -min 0.5  [get_ports {vACC_1_sign[2]}]
set_input_transition -max 0.5  [get_ports {vACC_1_sign[1]}]
set_input_transition -min 0.5  [get_ports {vACC_1_sign[1]}]
set_input_transition -max 0.5  [get_ports {vACC_1_sign[0]}]
set_input_transition -min 0.5  [get_ports {vACC_1_sign[0]}]
set_input_transition -max 0.5  [get_ports {vACC_2_sign[7]}]
set_input_transition -min 0.5  [get_ports {vACC_2_sign[7]}]
set_input_transition -max 0.5  [get_ports {vACC_2_sign[6]}]
set_input_transition -min 0.5  [get_ports {vACC_2_sign[6]}]
set_input_transition -max 0.5  [get_ports {vACC_2_sign[5]}]
set_input_transition -min 0.5  [get_ports {vACC_2_sign[5]}]
set_input_transition -max 0.5  [get_ports {vACC_2_sign[4]}]
set_input_transition -min 0.5  [get_ports {vACC_2_sign[4]}]
set_input_transition -max 0.5  [get_ports {vACC_2_sign[3]}]
set_input_transition -min 0.5  [get_ports {vACC_2_sign[3]}]
set_input_transition -max 0.5  [get_ports {vACC_2_sign[2]}]
set_input_transition -min 0.5  [get_ports {vACC_2_sign[2]}]
set_input_transition -max 0.5  [get_ports {vACC_2_sign[1]}]
set_input_transition -min 0.5  [get_ports {vACC_2_sign[1]}]
set_input_transition -max 0.5  [get_ports {vACC_2_sign[0]}]
set_input_transition -min 0.5  [get_ports {vACC_2_sign[0]}]
set_input_transition -max 0.5  [get_ports {vACC_3_sign[7]}]
set_input_transition -min 0.5  [get_ports {vACC_3_sign[7]}]
set_input_transition -max 0.5  [get_ports {vACC_3_sign[6]}]
set_input_transition -min 0.5  [get_ports {vACC_3_sign[6]}]
set_input_transition -max 0.5  [get_ports {vACC_3_sign[5]}]
set_input_transition -min 0.5  [get_ports {vACC_3_sign[5]}]
set_input_transition -max 0.5  [get_ports {vACC_3_sign[4]}]
set_input_transition -min 0.5  [get_ports {vACC_3_sign[4]}]
set_input_transition -max 0.5  [get_ports {vACC_3_sign[3]}]
set_input_transition -min 0.5  [get_ports {vACC_3_sign[3]}]
set_input_transition -max 0.5  [get_ports {vACC_3_sign[2]}]
set_input_transition -min 0.5  [get_ports {vACC_3_sign[2]}]
set_input_transition -max 0.5  [get_ports {vACC_3_sign[1]}]
set_input_transition -min 0.5  [get_ports {vACC_3_sign[1]}]
set_input_transition -max 0.5  [get_ports {vACC_3_sign[0]}]
set_input_transition -min 0.5  [get_ports {vACC_3_sign[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_0[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_0[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_0[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_0[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_1[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_1[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_1[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_1[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_2[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_2[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_2[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_2[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_3[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_3[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_3[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_3[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_4[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_4[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_4[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_4[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_5[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_5[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_5[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_5[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_6[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_6[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_6[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_6[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_7[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_7[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case0_7[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case0_7[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_0[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_0[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_0[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_0[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_1[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_1[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_1[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_1[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_2[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_2[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_2[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_2[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_3[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_3[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_3[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_3[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_4[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_4[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_4[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_4[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_5[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_5[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_5[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_5[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_6[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_6[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_6[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_6[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_7[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_7[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case1_7[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case1_7[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_0[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_0[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_0[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_0[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_1[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_1[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_1[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_1[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_2[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_2[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_2[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_2[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_3[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_3[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_3[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_3[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_4[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_4[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_4[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_4[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_5[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_5[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_5[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_5[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_6[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_6[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_6[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_6[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_7[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_7[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case2_7[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case2_7[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_0[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_0[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_0[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_0[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_1[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_1[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_1[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_1[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_2[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_2[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_2[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_2[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_3[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_3[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_3[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_3[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_4[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_4[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_4[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_4[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_5[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_5[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_5[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_5[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_6[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_6[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_6[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_6[0]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_7[1]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_7[1]}]
set_input_transition -max 0.5  [get_ports {lut_result_case3_7[0]}]
set_input_transition -min 0.5  [get_ports {lut_result_case3_7[0]}]
set_input_transition -max 0.5  [get_ports {burst_case[3]}]
set_input_transition -min 0.5  [get_ports {burst_case[3]}]
set_input_transition -max 0.5  [get_ports {burst_case[2]}]
set_input_transition -min 0.5  [get_ports {burst_case[2]}]
set_input_transition -max 0.5  [get_ports {burst_case[1]}]
set_input_transition -min 0.5  [get_ports {burst_case[1]}]
set_input_transition -max 0.5  [get_ports {burst_case[0]}]
set_input_transition -min 0.5  [get_ports {burst_case[0]}]
