###################################################################

# Created by write_sdc on Thu Dec 22 12:14:37 2022

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_max_fanout 8 [current_design]
set_max_area 0
set_ideal_network -no_propagate  [get_ports clk]
set_ideal_network -no_propagate  [get_ports rst_x]
create_clock [get_ports clk]  -name clk_ext  -period 20  -waveform {0 10}
set_false_path   -through [list [get_ports rst_x]]
set_input_delay -clock clk_ext  0  [get_ports rst_x]
set_input_delay -clock clk_ext  0  [get_ports HPC_clear_sig]
set_input_delay -clock clk_ext  0  [get_ports {req_data[255]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[254]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[253]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[252]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[251]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[250]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[249]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[248]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[247]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[246]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[245]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[244]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[243]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[242]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[241]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[240]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[239]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[238]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[237]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[236]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[235]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[234]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[233]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[232]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[231]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[230]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[229]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[228]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[227]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[226]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[225]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[224]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[223]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[222]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[221]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[220]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[219]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[218]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[217]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[216]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[215]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[214]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[213]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[212]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[211]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[210]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[209]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[208]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[207]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[206]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[205]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[204]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[203]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[202]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[201]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[200]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[199]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[198]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[197]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[196]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[195]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[194]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[193]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[192]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[191]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[190]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[189]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[188]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[187]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[186]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[185]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[184]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[183]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[182]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[181]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[180]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[179]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[178]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[177]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[176]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[175]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[174]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[173]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[172]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[171]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[170]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[169]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[168]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[167]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[166]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[165]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[164]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[163]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[162]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[161]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[160]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[159]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[158]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[157]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[156]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[155]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[154]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[153]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[152]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[151]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[150]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[149]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[148]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[147]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[146]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[145]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[144]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[143]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[142]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[141]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[140]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[139]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[138]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[137]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[136]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[135]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[134]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[133]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[132]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[131]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[130]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[129]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[128]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[127]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[126]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[125]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[124]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[123]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[122]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[121]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[120]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[119]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[118]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[117]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[116]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[115]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[114]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[113]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[112]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[111]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[110]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[109]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[108]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[107]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[106]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[105]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[104]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[103]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[102]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[101]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[100]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[99]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[98]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[97]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[96]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[95]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[94]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[93]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[92]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[91]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[90]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[89]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[88]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[87]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[86]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[85]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[84]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[83]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[82]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[81]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[80]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[79]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[78]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[77]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[76]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[75]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[74]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[73]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[72]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[71]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[70]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[69]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[68]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[67]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[66]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[65]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[64]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[63]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[62]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[61]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[60]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[59]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[58]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[57]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[56]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[55]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[54]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[53]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[52]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[51]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[50]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[49]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[48]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[47]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[46]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[45]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[44]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[43]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[42]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[41]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[40]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[39]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[38]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[37]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[36]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[35]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[34]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[33]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[32]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[31]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[30]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[29]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[28]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[27]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[26]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[25]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[24]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[23]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[22]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[21]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[20]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[19]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[18]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[17]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[16]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[15]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[14]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[13]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[12]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[11]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[10]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[9]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[8]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[7]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[6]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[5]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[4]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[3]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[2]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[1]}]
set_input_delay -clock clk_ext  0  [get_ports {req_data[0]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[255]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[254]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[253]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[252]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[251]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[250]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[249]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[248]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[247]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[246]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[245]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[244]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[243]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[242]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[241]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[240]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[239]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[238]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[237]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[236]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[235]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[234]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[233]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[232]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[231]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[230]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[229]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[228]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[227]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[226]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[225]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[224]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[223]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[222]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[221]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[220]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[219]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[218]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[217]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[216]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[215]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[214]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[213]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[212]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[211]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[210]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[209]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[208]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[207]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[206]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[205]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[204]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[203]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[202]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[201]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[200]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[199]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[198]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[197]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[196]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[195]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[194]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[193]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[192]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[191]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[190]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[189]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[188]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[187]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[186]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[185]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[184]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[183]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[182]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[181]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[180]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[179]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[178]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[177]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[176]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[175]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[174]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[173]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[172]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[171]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[170]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[169]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[168]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[167]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[166]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[165]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[164]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[163]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[162]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[161]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[160]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[159]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[158]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[157]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[156]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[155]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[154]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[153]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[152]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[151]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[150]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[149]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[148]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[147]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[146]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[145]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[144]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[143]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[142]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[141]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[140]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[139]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[138]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[137]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[136]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[135]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[134]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[133]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[132]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[131]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[130]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[129]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[128]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[127]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[126]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[125]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[124]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[123]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[122]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[121]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[120]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[119]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[118]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[117]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[116]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[115]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[114]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[113]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[112]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[111]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[110]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[109]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[108]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[107]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[106]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[105]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[104]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[103]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[102]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[101]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[100]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[99]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[98]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[97]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[96]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[95]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[94]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[93]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[92]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[91]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[90]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[89]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[88]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[87]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[86]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[85]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[84]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[83]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[82]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[81]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[80]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[79]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[78]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[77]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[76]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[75]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[74]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[73]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[72]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[71]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[70]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[69]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[68]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[67]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[66]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[65]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[64]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[63]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[62]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[61]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[60]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[59]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[58]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[57]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[56]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[55]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[54]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[53]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[52]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[51]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[50]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[49]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[48]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[47]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[46]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[45]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[44]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[43]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[42]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[41]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[40]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[39]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[38]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[37]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[36]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[35]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[34]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[33]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[32]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[31]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[30]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[29]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[28]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[27]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[26]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[25]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[24]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[23]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[22]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[21]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[20]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[19]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[18]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[17]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[16]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[15]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[14]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[13]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[12]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[11]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[10]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[9]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[8]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[7]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[6]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[5]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[4]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[3]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[2]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[1]}]
set_input_delay -clock clk_ext  0  [get_ports {DRAM_data[0]}]
set_input_delay -clock clk_ext  0  [get_ports src_A_RD_pass]
set_input_delay -clock clk_ext  0  [get_ports src_B_RD_pass]
set_input_delay -clock clk_ext  0  [get_ports dst_C_WR_pass]
set_input_delay -clock clk_ext  0  [get_ports req_MM_vecA_write]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[27]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[26]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[25]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[24]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[23]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[22]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[21]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[20]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[19]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[18]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[17]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[16]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[15]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[14]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[13]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[12]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[11]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[10]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[9]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[8]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[7]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[6]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[5]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[4]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[3]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[2]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[1]}]
set_input_delay -clock clk_ext  0  [get_ports {bank_config[0]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[255]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[254]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[253]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[252]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[251]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[250]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[249]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[248]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[247]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[246]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[245]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[244]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[243]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[242]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[241]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[240]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[239]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[238]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[237]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[236]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[235]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[234]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[233]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[232]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[231]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[230]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[229]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[228]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[227]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[226]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[225]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[224]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[223]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[222]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[221]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[220]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[219]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[218]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[217]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[216]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[215]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[214]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[213]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[212]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[211]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[210]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[209]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[208]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[207]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[206]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[205]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[204]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[203]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[202]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[201]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[200]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[199]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[198]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[197]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[196]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[195]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[194]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[193]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[192]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[191]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[190]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[189]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[188]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[187]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[186]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[185]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[184]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[183]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[182]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[181]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[180]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[179]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[178]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[177]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[176]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[175]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[174]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[173]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[172]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[171]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[170]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[169]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[168]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[167]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[166]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[165]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[164]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[163]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[162]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[161]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[160]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[159]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[158]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[157]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[156]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[155]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[154]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[153]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[152]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[151]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[150]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[149]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[148]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[147]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[146]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[145]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[144]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[143]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[142]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[141]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[140]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[139]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[138]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[137]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[136]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[135]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[134]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[133]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[132]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[131]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[130]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[129]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[128]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[127]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[126]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[125]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[124]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[123]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[122]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[121]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[120]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[119]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[118]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[117]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[116]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[115]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[114]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[113]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[112]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[111]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[110]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[109]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[108]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[107]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[106]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[105]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[104]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[103]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[102]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[101]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[100]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[99]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[98]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[97]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[96]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[95]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[94]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[93]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[92]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[91]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[90]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[89]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[88]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[87]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[86]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[85]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[84]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[83]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[82]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[81]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[80]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[79]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[78]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[77]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[76]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[75]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[74]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[73]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[72]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[71]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[70]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[69]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[68]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[67]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[66]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[65]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[64]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[63]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[62]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[61]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[60]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[59]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[58]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[57]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[56]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[55]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[54]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[53]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[52]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[51]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[50]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[49]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[48]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[47]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[46]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[45]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[44]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[43]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[42]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[41]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[40]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[39]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[38]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[37]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[36]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[35]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[34]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[33]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[32]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[31]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[30]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[29]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[28]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[27]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[26]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[25]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[24]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[23]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[22]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[21]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[20]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[19]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[18]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[17]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[16]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[15]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[14]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[13]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[12]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[11]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[10]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[9]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[8]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[7]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[6]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[5]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[4]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[3]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[2]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[1]}]
set_output_delay -clock clk_ext  0  [get_ports {PIM_result[0]}]
set_input_transition -max 0.5  [get_ports rst_x]
set_input_transition -min 0.5  [get_ports rst_x]
set_input_transition -max 0.5  [get_ports HPC_clear_sig]
set_input_transition -min 0.5  [get_ports HPC_clear_sig]
set_input_transition -max 0.5  [get_ports {req_data[255]}]
set_input_transition -min 0.5  [get_ports {req_data[255]}]
set_input_transition -max 0.5  [get_ports {req_data[254]}]
set_input_transition -min 0.5  [get_ports {req_data[254]}]
set_input_transition -max 0.5  [get_ports {req_data[253]}]
set_input_transition -min 0.5  [get_ports {req_data[253]}]
set_input_transition -max 0.5  [get_ports {req_data[252]}]
set_input_transition -min 0.5  [get_ports {req_data[252]}]
set_input_transition -max 0.5  [get_ports {req_data[251]}]
set_input_transition -min 0.5  [get_ports {req_data[251]}]
set_input_transition -max 0.5  [get_ports {req_data[250]}]
set_input_transition -min 0.5  [get_ports {req_data[250]}]
set_input_transition -max 0.5  [get_ports {req_data[249]}]
set_input_transition -min 0.5  [get_ports {req_data[249]}]
set_input_transition -max 0.5  [get_ports {req_data[248]}]
set_input_transition -min 0.5  [get_ports {req_data[248]}]
set_input_transition -max 0.5  [get_ports {req_data[247]}]
set_input_transition -min 0.5  [get_ports {req_data[247]}]
set_input_transition -max 0.5  [get_ports {req_data[246]}]
set_input_transition -min 0.5  [get_ports {req_data[246]}]
set_input_transition -max 0.5  [get_ports {req_data[245]}]
set_input_transition -min 0.5  [get_ports {req_data[245]}]
set_input_transition -max 0.5  [get_ports {req_data[244]}]
set_input_transition -min 0.5  [get_ports {req_data[244]}]
set_input_transition -max 0.5  [get_ports {req_data[243]}]
set_input_transition -min 0.5  [get_ports {req_data[243]}]
set_input_transition -max 0.5  [get_ports {req_data[242]}]
set_input_transition -min 0.5  [get_ports {req_data[242]}]
set_input_transition -max 0.5  [get_ports {req_data[241]}]
set_input_transition -min 0.5  [get_ports {req_data[241]}]
set_input_transition -max 0.5  [get_ports {req_data[240]}]
set_input_transition -min 0.5  [get_ports {req_data[240]}]
set_input_transition -max 0.5  [get_ports {req_data[239]}]
set_input_transition -min 0.5  [get_ports {req_data[239]}]
set_input_transition -max 0.5  [get_ports {req_data[238]}]
set_input_transition -min 0.5  [get_ports {req_data[238]}]
set_input_transition -max 0.5  [get_ports {req_data[237]}]
set_input_transition -min 0.5  [get_ports {req_data[237]}]
set_input_transition -max 0.5  [get_ports {req_data[236]}]
set_input_transition -min 0.5  [get_ports {req_data[236]}]
set_input_transition -max 0.5  [get_ports {req_data[235]}]
set_input_transition -min 0.5  [get_ports {req_data[235]}]
set_input_transition -max 0.5  [get_ports {req_data[234]}]
set_input_transition -min 0.5  [get_ports {req_data[234]}]
set_input_transition -max 0.5  [get_ports {req_data[233]}]
set_input_transition -min 0.5  [get_ports {req_data[233]}]
set_input_transition -max 0.5  [get_ports {req_data[232]}]
set_input_transition -min 0.5  [get_ports {req_data[232]}]
set_input_transition -max 0.5  [get_ports {req_data[231]}]
set_input_transition -min 0.5  [get_ports {req_data[231]}]
set_input_transition -max 0.5  [get_ports {req_data[230]}]
set_input_transition -min 0.5  [get_ports {req_data[230]}]
set_input_transition -max 0.5  [get_ports {req_data[229]}]
set_input_transition -min 0.5  [get_ports {req_data[229]}]
set_input_transition -max 0.5  [get_ports {req_data[228]}]
set_input_transition -min 0.5  [get_ports {req_data[228]}]
set_input_transition -max 0.5  [get_ports {req_data[227]}]
set_input_transition -min 0.5  [get_ports {req_data[227]}]
set_input_transition -max 0.5  [get_ports {req_data[226]}]
set_input_transition -min 0.5  [get_ports {req_data[226]}]
set_input_transition -max 0.5  [get_ports {req_data[225]}]
set_input_transition -min 0.5  [get_ports {req_data[225]}]
set_input_transition -max 0.5  [get_ports {req_data[224]}]
set_input_transition -min 0.5  [get_ports {req_data[224]}]
set_input_transition -max 0.5  [get_ports {req_data[223]}]
set_input_transition -min 0.5  [get_ports {req_data[223]}]
set_input_transition -max 0.5  [get_ports {req_data[222]}]
set_input_transition -min 0.5  [get_ports {req_data[222]}]
set_input_transition -max 0.5  [get_ports {req_data[221]}]
set_input_transition -min 0.5  [get_ports {req_data[221]}]
set_input_transition -max 0.5  [get_ports {req_data[220]}]
set_input_transition -min 0.5  [get_ports {req_data[220]}]
set_input_transition -max 0.5  [get_ports {req_data[219]}]
set_input_transition -min 0.5  [get_ports {req_data[219]}]
set_input_transition -max 0.5  [get_ports {req_data[218]}]
set_input_transition -min 0.5  [get_ports {req_data[218]}]
set_input_transition -max 0.5  [get_ports {req_data[217]}]
set_input_transition -min 0.5  [get_ports {req_data[217]}]
set_input_transition -max 0.5  [get_ports {req_data[216]}]
set_input_transition -min 0.5  [get_ports {req_data[216]}]
set_input_transition -max 0.5  [get_ports {req_data[215]}]
set_input_transition -min 0.5  [get_ports {req_data[215]}]
set_input_transition -max 0.5  [get_ports {req_data[214]}]
set_input_transition -min 0.5  [get_ports {req_data[214]}]
set_input_transition -max 0.5  [get_ports {req_data[213]}]
set_input_transition -min 0.5  [get_ports {req_data[213]}]
set_input_transition -max 0.5  [get_ports {req_data[212]}]
set_input_transition -min 0.5  [get_ports {req_data[212]}]
set_input_transition -max 0.5  [get_ports {req_data[211]}]
set_input_transition -min 0.5  [get_ports {req_data[211]}]
set_input_transition -max 0.5  [get_ports {req_data[210]}]
set_input_transition -min 0.5  [get_ports {req_data[210]}]
set_input_transition -max 0.5  [get_ports {req_data[209]}]
set_input_transition -min 0.5  [get_ports {req_data[209]}]
set_input_transition -max 0.5  [get_ports {req_data[208]}]
set_input_transition -min 0.5  [get_ports {req_data[208]}]
set_input_transition -max 0.5  [get_ports {req_data[207]}]
set_input_transition -min 0.5  [get_ports {req_data[207]}]
set_input_transition -max 0.5  [get_ports {req_data[206]}]
set_input_transition -min 0.5  [get_ports {req_data[206]}]
set_input_transition -max 0.5  [get_ports {req_data[205]}]
set_input_transition -min 0.5  [get_ports {req_data[205]}]
set_input_transition -max 0.5  [get_ports {req_data[204]}]
set_input_transition -min 0.5  [get_ports {req_data[204]}]
set_input_transition -max 0.5  [get_ports {req_data[203]}]
set_input_transition -min 0.5  [get_ports {req_data[203]}]
set_input_transition -max 0.5  [get_ports {req_data[202]}]
set_input_transition -min 0.5  [get_ports {req_data[202]}]
set_input_transition -max 0.5  [get_ports {req_data[201]}]
set_input_transition -min 0.5  [get_ports {req_data[201]}]
set_input_transition -max 0.5  [get_ports {req_data[200]}]
set_input_transition -min 0.5  [get_ports {req_data[200]}]
set_input_transition -max 0.5  [get_ports {req_data[199]}]
set_input_transition -min 0.5  [get_ports {req_data[199]}]
set_input_transition -max 0.5  [get_ports {req_data[198]}]
set_input_transition -min 0.5  [get_ports {req_data[198]}]
set_input_transition -max 0.5  [get_ports {req_data[197]}]
set_input_transition -min 0.5  [get_ports {req_data[197]}]
set_input_transition -max 0.5  [get_ports {req_data[196]}]
set_input_transition -min 0.5  [get_ports {req_data[196]}]
set_input_transition -max 0.5  [get_ports {req_data[195]}]
set_input_transition -min 0.5  [get_ports {req_data[195]}]
set_input_transition -max 0.5  [get_ports {req_data[194]}]
set_input_transition -min 0.5  [get_ports {req_data[194]}]
set_input_transition -max 0.5  [get_ports {req_data[193]}]
set_input_transition -min 0.5  [get_ports {req_data[193]}]
set_input_transition -max 0.5  [get_ports {req_data[192]}]
set_input_transition -min 0.5  [get_ports {req_data[192]}]
set_input_transition -max 0.5  [get_ports {req_data[191]}]
set_input_transition -min 0.5  [get_ports {req_data[191]}]
set_input_transition -max 0.5  [get_ports {req_data[190]}]
set_input_transition -min 0.5  [get_ports {req_data[190]}]
set_input_transition -max 0.5  [get_ports {req_data[189]}]
set_input_transition -min 0.5  [get_ports {req_data[189]}]
set_input_transition -max 0.5  [get_ports {req_data[188]}]
set_input_transition -min 0.5  [get_ports {req_data[188]}]
set_input_transition -max 0.5  [get_ports {req_data[187]}]
set_input_transition -min 0.5  [get_ports {req_data[187]}]
set_input_transition -max 0.5  [get_ports {req_data[186]}]
set_input_transition -min 0.5  [get_ports {req_data[186]}]
set_input_transition -max 0.5  [get_ports {req_data[185]}]
set_input_transition -min 0.5  [get_ports {req_data[185]}]
set_input_transition -max 0.5  [get_ports {req_data[184]}]
set_input_transition -min 0.5  [get_ports {req_data[184]}]
set_input_transition -max 0.5  [get_ports {req_data[183]}]
set_input_transition -min 0.5  [get_ports {req_data[183]}]
set_input_transition -max 0.5  [get_ports {req_data[182]}]
set_input_transition -min 0.5  [get_ports {req_data[182]}]
set_input_transition -max 0.5  [get_ports {req_data[181]}]
set_input_transition -min 0.5  [get_ports {req_data[181]}]
set_input_transition -max 0.5  [get_ports {req_data[180]}]
set_input_transition -min 0.5  [get_ports {req_data[180]}]
set_input_transition -max 0.5  [get_ports {req_data[179]}]
set_input_transition -min 0.5  [get_ports {req_data[179]}]
set_input_transition -max 0.5  [get_ports {req_data[178]}]
set_input_transition -min 0.5  [get_ports {req_data[178]}]
set_input_transition -max 0.5  [get_ports {req_data[177]}]
set_input_transition -min 0.5  [get_ports {req_data[177]}]
set_input_transition -max 0.5  [get_ports {req_data[176]}]
set_input_transition -min 0.5  [get_ports {req_data[176]}]
set_input_transition -max 0.5  [get_ports {req_data[175]}]
set_input_transition -min 0.5  [get_ports {req_data[175]}]
set_input_transition -max 0.5  [get_ports {req_data[174]}]
set_input_transition -min 0.5  [get_ports {req_data[174]}]
set_input_transition -max 0.5  [get_ports {req_data[173]}]
set_input_transition -min 0.5  [get_ports {req_data[173]}]
set_input_transition -max 0.5  [get_ports {req_data[172]}]
set_input_transition -min 0.5  [get_ports {req_data[172]}]
set_input_transition -max 0.5  [get_ports {req_data[171]}]
set_input_transition -min 0.5  [get_ports {req_data[171]}]
set_input_transition -max 0.5  [get_ports {req_data[170]}]
set_input_transition -min 0.5  [get_ports {req_data[170]}]
set_input_transition -max 0.5  [get_ports {req_data[169]}]
set_input_transition -min 0.5  [get_ports {req_data[169]}]
set_input_transition -max 0.5  [get_ports {req_data[168]}]
set_input_transition -min 0.5  [get_ports {req_data[168]}]
set_input_transition -max 0.5  [get_ports {req_data[167]}]
set_input_transition -min 0.5  [get_ports {req_data[167]}]
set_input_transition -max 0.5  [get_ports {req_data[166]}]
set_input_transition -min 0.5  [get_ports {req_data[166]}]
set_input_transition -max 0.5  [get_ports {req_data[165]}]
set_input_transition -min 0.5  [get_ports {req_data[165]}]
set_input_transition -max 0.5  [get_ports {req_data[164]}]
set_input_transition -min 0.5  [get_ports {req_data[164]}]
set_input_transition -max 0.5  [get_ports {req_data[163]}]
set_input_transition -min 0.5  [get_ports {req_data[163]}]
set_input_transition -max 0.5  [get_ports {req_data[162]}]
set_input_transition -min 0.5  [get_ports {req_data[162]}]
set_input_transition -max 0.5  [get_ports {req_data[161]}]
set_input_transition -min 0.5  [get_ports {req_data[161]}]
set_input_transition -max 0.5  [get_ports {req_data[160]}]
set_input_transition -min 0.5  [get_ports {req_data[160]}]
set_input_transition -max 0.5  [get_ports {req_data[159]}]
set_input_transition -min 0.5  [get_ports {req_data[159]}]
set_input_transition -max 0.5  [get_ports {req_data[158]}]
set_input_transition -min 0.5  [get_ports {req_data[158]}]
set_input_transition -max 0.5  [get_ports {req_data[157]}]
set_input_transition -min 0.5  [get_ports {req_data[157]}]
set_input_transition -max 0.5  [get_ports {req_data[156]}]
set_input_transition -min 0.5  [get_ports {req_data[156]}]
set_input_transition -max 0.5  [get_ports {req_data[155]}]
set_input_transition -min 0.5  [get_ports {req_data[155]}]
set_input_transition -max 0.5  [get_ports {req_data[154]}]
set_input_transition -min 0.5  [get_ports {req_data[154]}]
set_input_transition -max 0.5  [get_ports {req_data[153]}]
set_input_transition -min 0.5  [get_ports {req_data[153]}]
set_input_transition -max 0.5  [get_ports {req_data[152]}]
set_input_transition -min 0.5  [get_ports {req_data[152]}]
set_input_transition -max 0.5  [get_ports {req_data[151]}]
set_input_transition -min 0.5  [get_ports {req_data[151]}]
set_input_transition -max 0.5  [get_ports {req_data[150]}]
set_input_transition -min 0.5  [get_ports {req_data[150]}]
set_input_transition -max 0.5  [get_ports {req_data[149]}]
set_input_transition -min 0.5  [get_ports {req_data[149]}]
set_input_transition -max 0.5  [get_ports {req_data[148]}]
set_input_transition -min 0.5  [get_ports {req_data[148]}]
set_input_transition -max 0.5  [get_ports {req_data[147]}]
set_input_transition -min 0.5  [get_ports {req_data[147]}]
set_input_transition -max 0.5  [get_ports {req_data[146]}]
set_input_transition -min 0.5  [get_ports {req_data[146]}]
set_input_transition -max 0.5  [get_ports {req_data[145]}]
set_input_transition -min 0.5  [get_ports {req_data[145]}]
set_input_transition -max 0.5  [get_ports {req_data[144]}]
set_input_transition -min 0.5  [get_ports {req_data[144]}]
set_input_transition -max 0.5  [get_ports {req_data[143]}]
set_input_transition -min 0.5  [get_ports {req_data[143]}]
set_input_transition -max 0.5  [get_ports {req_data[142]}]
set_input_transition -min 0.5  [get_ports {req_data[142]}]
set_input_transition -max 0.5  [get_ports {req_data[141]}]
set_input_transition -min 0.5  [get_ports {req_data[141]}]
set_input_transition -max 0.5  [get_ports {req_data[140]}]
set_input_transition -min 0.5  [get_ports {req_data[140]}]
set_input_transition -max 0.5  [get_ports {req_data[139]}]
set_input_transition -min 0.5  [get_ports {req_data[139]}]
set_input_transition -max 0.5  [get_ports {req_data[138]}]
set_input_transition -min 0.5  [get_ports {req_data[138]}]
set_input_transition -max 0.5  [get_ports {req_data[137]}]
set_input_transition -min 0.5  [get_ports {req_data[137]}]
set_input_transition -max 0.5  [get_ports {req_data[136]}]
set_input_transition -min 0.5  [get_ports {req_data[136]}]
set_input_transition -max 0.5  [get_ports {req_data[135]}]
set_input_transition -min 0.5  [get_ports {req_data[135]}]
set_input_transition -max 0.5  [get_ports {req_data[134]}]
set_input_transition -min 0.5  [get_ports {req_data[134]}]
set_input_transition -max 0.5  [get_ports {req_data[133]}]
set_input_transition -min 0.5  [get_ports {req_data[133]}]
set_input_transition -max 0.5  [get_ports {req_data[132]}]
set_input_transition -min 0.5  [get_ports {req_data[132]}]
set_input_transition -max 0.5  [get_ports {req_data[131]}]
set_input_transition -min 0.5  [get_ports {req_data[131]}]
set_input_transition -max 0.5  [get_ports {req_data[130]}]
set_input_transition -min 0.5  [get_ports {req_data[130]}]
set_input_transition -max 0.5  [get_ports {req_data[129]}]
set_input_transition -min 0.5  [get_ports {req_data[129]}]
set_input_transition -max 0.5  [get_ports {req_data[128]}]
set_input_transition -min 0.5  [get_ports {req_data[128]}]
set_input_transition -max 0.5  [get_ports {req_data[127]}]
set_input_transition -min 0.5  [get_ports {req_data[127]}]
set_input_transition -max 0.5  [get_ports {req_data[126]}]
set_input_transition -min 0.5  [get_ports {req_data[126]}]
set_input_transition -max 0.5  [get_ports {req_data[125]}]
set_input_transition -min 0.5  [get_ports {req_data[125]}]
set_input_transition -max 0.5  [get_ports {req_data[124]}]
set_input_transition -min 0.5  [get_ports {req_data[124]}]
set_input_transition -max 0.5  [get_ports {req_data[123]}]
set_input_transition -min 0.5  [get_ports {req_data[123]}]
set_input_transition -max 0.5  [get_ports {req_data[122]}]
set_input_transition -min 0.5  [get_ports {req_data[122]}]
set_input_transition -max 0.5  [get_ports {req_data[121]}]
set_input_transition -min 0.5  [get_ports {req_data[121]}]
set_input_transition -max 0.5  [get_ports {req_data[120]}]
set_input_transition -min 0.5  [get_ports {req_data[120]}]
set_input_transition -max 0.5  [get_ports {req_data[119]}]
set_input_transition -min 0.5  [get_ports {req_data[119]}]
set_input_transition -max 0.5  [get_ports {req_data[118]}]
set_input_transition -min 0.5  [get_ports {req_data[118]}]
set_input_transition -max 0.5  [get_ports {req_data[117]}]
set_input_transition -min 0.5  [get_ports {req_data[117]}]
set_input_transition -max 0.5  [get_ports {req_data[116]}]
set_input_transition -min 0.5  [get_ports {req_data[116]}]
set_input_transition -max 0.5  [get_ports {req_data[115]}]
set_input_transition -min 0.5  [get_ports {req_data[115]}]
set_input_transition -max 0.5  [get_ports {req_data[114]}]
set_input_transition -min 0.5  [get_ports {req_data[114]}]
set_input_transition -max 0.5  [get_ports {req_data[113]}]
set_input_transition -min 0.5  [get_ports {req_data[113]}]
set_input_transition -max 0.5  [get_ports {req_data[112]}]
set_input_transition -min 0.5  [get_ports {req_data[112]}]
set_input_transition -max 0.5  [get_ports {req_data[111]}]
set_input_transition -min 0.5  [get_ports {req_data[111]}]
set_input_transition -max 0.5  [get_ports {req_data[110]}]
set_input_transition -min 0.5  [get_ports {req_data[110]}]
set_input_transition -max 0.5  [get_ports {req_data[109]}]
set_input_transition -min 0.5  [get_ports {req_data[109]}]
set_input_transition -max 0.5  [get_ports {req_data[108]}]
set_input_transition -min 0.5  [get_ports {req_data[108]}]
set_input_transition -max 0.5  [get_ports {req_data[107]}]
set_input_transition -min 0.5  [get_ports {req_data[107]}]
set_input_transition -max 0.5  [get_ports {req_data[106]}]
set_input_transition -min 0.5  [get_ports {req_data[106]}]
set_input_transition -max 0.5  [get_ports {req_data[105]}]
set_input_transition -min 0.5  [get_ports {req_data[105]}]
set_input_transition -max 0.5  [get_ports {req_data[104]}]
set_input_transition -min 0.5  [get_ports {req_data[104]}]
set_input_transition -max 0.5  [get_ports {req_data[103]}]
set_input_transition -min 0.5  [get_ports {req_data[103]}]
set_input_transition -max 0.5  [get_ports {req_data[102]}]
set_input_transition -min 0.5  [get_ports {req_data[102]}]
set_input_transition -max 0.5  [get_ports {req_data[101]}]
set_input_transition -min 0.5  [get_ports {req_data[101]}]
set_input_transition -max 0.5  [get_ports {req_data[100]}]
set_input_transition -min 0.5  [get_ports {req_data[100]}]
set_input_transition -max 0.5  [get_ports {req_data[99]}]
set_input_transition -min 0.5  [get_ports {req_data[99]}]
set_input_transition -max 0.5  [get_ports {req_data[98]}]
set_input_transition -min 0.5  [get_ports {req_data[98]}]
set_input_transition -max 0.5  [get_ports {req_data[97]}]
set_input_transition -min 0.5  [get_ports {req_data[97]}]
set_input_transition -max 0.5  [get_ports {req_data[96]}]
set_input_transition -min 0.5  [get_ports {req_data[96]}]
set_input_transition -max 0.5  [get_ports {req_data[95]}]
set_input_transition -min 0.5  [get_ports {req_data[95]}]
set_input_transition -max 0.5  [get_ports {req_data[94]}]
set_input_transition -min 0.5  [get_ports {req_data[94]}]
set_input_transition -max 0.5  [get_ports {req_data[93]}]
set_input_transition -min 0.5  [get_ports {req_data[93]}]
set_input_transition -max 0.5  [get_ports {req_data[92]}]
set_input_transition -min 0.5  [get_ports {req_data[92]}]
set_input_transition -max 0.5  [get_ports {req_data[91]}]
set_input_transition -min 0.5  [get_ports {req_data[91]}]
set_input_transition -max 0.5  [get_ports {req_data[90]}]
set_input_transition -min 0.5  [get_ports {req_data[90]}]
set_input_transition -max 0.5  [get_ports {req_data[89]}]
set_input_transition -min 0.5  [get_ports {req_data[89]}]
set_input_transition -max 0.5  [get_ports {req_data[88]}]
set_input_transition -min 0.5  [get_ports {req_data[88]}]
set_input_transition -max 0.5  [get_ports {req_data[87]}]
set_input_transition -min 0.5  [get_ports {req_data[87]}]
set_input_transition -max 0.5  [get_ports {req_data[86]}]
set_input_transition -min 0.5  [get_ports {req_data[86]}]
set_input_transition -max 0.5  [get_ports {req_data[85]}]
set_input_transition -min 0.5  [get_ports {req_data[85]}]
set_input_transition -max 0.5  [get_ports {req_data[84]}]
set_input_transition -min 0.5  [get_ports {req_data[84]}]
set_input_transition -max 0.5  [get_ports {req_data[83]}]
set_input_transition -min 0.5  [get_ports {req_data[83]}]
set_input_transition -max 0.5  [get_ports {req_data[82]}]
set_input_transition -min 0.5  [get_ports {req_data[82]}]
set_input_transition -max 0.5  [get_ports {req_data[81]}]
set_input_transition -min 0.5  [get_ports {req_data[81]}]
set_input_transition -max 0.5  [get_ports {req_data[80]}]
set_input_transition -min 0.5  [get_ports {req_data[80]}]
set_input_transition -max 0.5  [get_ports {req_data[79]}]
set_input_transition -min 0.5  [get_ports {req_data[79]}]
set_input_transition -max 0.5  [get_ports {req_data[78]}]
set_input_transition -min 0.5  [get_ports {req_data[78]}]
set_input_transition -max 0.5  [get_ports {req_data[77]}]
set_input_transition -min 0.5  [get_ports {req_data[77]}]
set_input_transition -max 0.5  [get_ports {req_data[76]}]
set_input_transition -min 0.5  [get_ports {req_data[76]}]
set_input_transition -max 0.5  [get_ports {req_data[75]}]
set_input_transition -min 0.5  [get_ports {req_data[75]}]
set_input_transition -max 0.5  [get_ports {req_data[74]}]
set_input_transition -min 0.5  [get_ports {req_data[74]}]
set_input_transition -max 0.5  [get_ports {req_data[73]}]
set_input_transition -min 0.5  [get_ports {req_data[73]}]
set_input_transition -max 0.5  [get_ports {req_data[72]}]
set_input_transition -min 0.5  [get_ports {req_data[72]}]
set_input_transition -max 0.5  [get_ports {req_data[71]}]
set_input_transition -min 0.5  [get_ports {req_data[71]}]
set_input_transition -max 0.5  [get_ports {req_data[70]}]
set_input_transition -min 0.5  [get_ports {req_data[70]}]
set_input_transition -max 0.5  [get_ports {req_data[69]}]
set_input_transition -min 0.5  [get_ports {req_data[69]}]
set_input_transition -max 0.5  [get_ports {req_data[68]}]
set_input_transition -min 0.5  [get_ports {req_data[68]}]
set_input_transition -max 0.5  [get_ports {req_data[67]}]
set_input_transition -min 0.5  [get_ports {req_data[67]}]
set_input_transition -max 0.5  [get_ports {req_data[66]}]
set_input_transition -min 0.5  [get_ports {req_data[66]}]
set_input_transition -max 0.5  [get_ports {req_data[65]}]
set_input_transition -min 0.5  [get_ports {req_data[65]}]
set_input_transition -max 0.5  [get_ports {req_data[64]}]
set_input_transition -min 0.5  [get_ports {req_data[64]}]
set_input_transition -max 0.5  [get_ports {req_data[63]}]
set_input_transition -min 0.5  [get_ports {req_data[63]}]
set_input_transition -max 0.5  [get_ports {req_data[62]}]
set_input_transition -min 0.5  [get_ports {req_data[62]}]
set_input_transition -max 0.5  [get_ports {req_data[61]}]
set_input_transition -min 0.5  [get_ports {req_data[61]}]
set_input_transition -max 0.5  [get_ports {req_data[60]}]
set_input_transition -min 0.5  [get_ports {req_data[60]}]
set_input_transition -max 0.5  [get_ports {req_data[59]}]
set_input_transition -min 0.5  [get_ports {req_data[59]}]
set_input_transition -max 0.5  [get_ports {req_data[58]}]
set_input_transition -min 0.5  [get_ports {req_data[58]}]
set_input_transition -max 0.5  [get_ports {req_data[57]}]
set_input_transition -min 0.5  [get_ports {req_data[57]}]
set_input_transition -max 0.5  [get_ports {req_data[56]}]
set_input_transition -min 0.5  [get_ports {req_data[56]}]
set_input_transition -max 0.5  [get_ports {req_data[55]}]
set_input_transition -min 0.5  [get_ports {req_data[55]}]
set_input_transition -max 0.5  [get_ports {req_data[54]}]
set_input_transition -min 0.5  [get_ports {req_data[54]}]
set_input_transition -max 0.5  [get_ports {req_data[53]}]
set_input_transition -min 0.5  [get_ports {req_data[53]}]
set_input_transition -max 0.5  [get_ports {req_data[52]}]
set_input_transition -min 0.5  [get_ports {req_data[52]}]
set_input_transition -max 0.5  [get_ports {req_data[51]}]
set_input_transition -min 0.5  [get_ports {req_data[51]}]
set_input_transition -max 0.5  [get_ports {req_data[50]}]
set_input_transition -min 0.5  [get_ports {req_data[50]}]
set_input_transition -max 0.5  [get_ports {req_data[49]}]
set_input_transition -min 0.5  [get_ports {req_data[49]}]
set_input_transition -max 0.5  [get_ports {req_data[48]}]
set_input_transition -min 0.5  [get_ports {req_data[48]}]
set_input_transition -max 0.5  [get_ports {req_data[47]}]
set_input_transition -min 0.5  [get_ports {req_data[47]}]
set_input_transition -max 0.5  [get_ports {req_data[46]}]
set_input_transition -min 0.5  [get_ports {req_data[46]}]
set_input_transition -max 0.5  [get_ports {req_data[45]}]
set_input_transition -min 0.5  [get_ports {req_data[45]}]
set_input_transition -max 0.5  [get_ports {req_data[44]}]
set_input_transition -min 0.5  [get_ports {req_data[44]}]
set_input_transition -max 0.5  [get_ports {req_data[43]}]
set_input_transition -min 0.5  [get_ports {req_data[43]}]
set_input_transition -max 0.5  [get_ports {req_data[42]}]
set_input_transition -min 0.5  [get_ports {req_data[42]}]
set_input_transition -max 0.5  [get_ports {req_data[41]}]
set_input_transition -min 0.5  [get_ports {req_data[41]}]
set_input_transition -max 0.5  [get_ports {req_data[40]}]
set_input_transition -min 0.5  [get_ports {req_data[40]}]
set_input_transition -max 0.5  [get_ports {req_data[39]}]
set_input_transition -min 0.5  [get_ports {req_data[39]}]
set_input_transition -max 0.5  [get_ports {req_data[38]}]
set_input_transition -min 0.5  [get_ports {req_data[38]}]
set_input_transition -max 0.5  [get_ports {req_data[37]}]
set_input_transition -min 0.5  [get_ports {req_data[37]}]
set_input_transition -max 0.5  [get_ports {req_data[36]}]
set_input_transition -min 0.5  [get_ports {req_data[36]}]
set_input_transition -max 0.5  [get_ports {req_data[35]}]
set_input_transition -min 0.5  [get_ports {req_data[35]}]
set_input_transition -max 0.5  [get_ports {req_data[34]}]
set_input_transition -min 0.5  [get_ports {req_data[34]}]
set_input_transition -max 0.5  [get_ports {req_data[33]}]
set_input_transition -min 0.5  [get_ports {req_data[33]}]
set_input_transition -max 0.5  [get_ports {req_data[32]}]
set_input_transition -min 0.5  [get_ports {req_data[32]}]
set_input_transition -max 0.5  [get_ports {req_data[31]}]
set_input_transition -min 0.5  [get_ports {req_data[31]}]
set_input_transition -max 0.5  [get_ports {req_data[30]}]
set_input_transition -min 0.5  [get_ports {req_data[30]}]
set_input_transition -max 0.5  [get_ports {req_data[29]}]
set_input_transition -min 0.5  [get_ports {req_data[29]}]
set_input_transition -max 0.5  [get_ports {req_data[28]}]
set_input_transition -min 0.5  [get_ports {req_data[28]}]
set_input_transition -max 0.5  [get_ports {req_data[27]}]
set_input_transition -min 0.5  [get_ports {req_data[27]}]
set_input_transition -max 0.5  [get_ports {req_data[26]}]
set_input_transition -min 0.5  [get_ports {req_data[26]}]
set_input_transition -max 0.5  [get_ports {req_data[25]}]
set_input_transition -min 0.5  [get_ports {req_data[25]}]
set_input_transition -max 0.5  [get_ports {req_data[24]}]
set_input_transition -min 0.5  [get_ports {req_data[24]}]
set_input_transition -max 0.5  [get_ports {req_data[23]}]
set_input_transition -min 0.5  [get_ports {req_data[23]}]
set_input_transition -max 0.5  [get_ports {req_data[22]}]
set_input_transition -min 0.5  [get_ports {req_data[22]}]
set_input_transition -max 0.5  [get_ports {req_data[21]}]
set_input_transition -min 0.5  [get_ports {req_data[21]}]
set_input_transition -max 0.5  [get_ports {req_data[20]}]
set_input_transition -min 0.5  [get_ports {req_data[20]}]
set_input_transition -max 0.5  [get_ports {req_data[19]}]
set_input_transition -min 0.5  [get_ports {req_data[19]}]
set_input_transition -max 0.5  [get_ports {req_data[18]}]
set_input_transition -min 0.5  [get_ports {req_data[18]}]
set_input_transition -max 0.5  [get_ports {req_data[17]}]
set_input_transition -min 0.5  [get_ports {req_data[17]}]
set_input_transition -max 0.5  [get_ports {req_data[16]}]
set_input_transition -min 0.5  [get_ports {req_data[16]}]
set_input_transition -max 0.5  [get_ports {req_data[15]}]
set_input_transition -min 0.5  [get_ports {req_data[15]}]
set_input_transition -max 0.5  [get_ports {req_data[14]}]
set_input_transition -min 0.5  [get_ports {req_data[14]}]
set_input_transition -max 0.5  [get_ports {req_data[13]}]
set_input_transition -min 0.5  [get_ports {req_data[13]}]
set_input_transition -max 0.5  [get_ports {req_data[12]}]
set_input_transition -min 0.5  [get_ports {req_data[12]}]
set_input_transition -max 0.5  [get_ports {req_data[11]}]
set_input_transition -min 0.5  [get_ports {req_data[11]}]
set_input_transition -max 0.5  [get_ports {req_data[10]}]
set_input_transition -min 0.5  [get_ports {req_data[10]}]
set_input_transition -max 0.5  [get_ports {req_data[9]}]
set_input_transition -min 0.5  [get_ports {req_data[9]}]
set_input_transition -max 0.5  [get_ports {req_data[8]}]
set_input_transition -min 0.5  [get_ports {req_data[8]}]
set_input_transition -max 0.5  [get_ports {req_data[7]}]
set_input_transition -min 0.5  [get_ports {req_data[7]}]
set_input_transition -max 0.5  [get_ports {req_data[6]}]
set_input_transition -min 0.5  [get_ports {req_data[6]}]
set_input_transition -max 0.5  [get_ports {req_data[5]}]
set_input_transition -min 0.5  [get_ports {req_data[5]}]
set_input_transition -max 0.5  [get_ports {req_data[4]}]
set_input_transition -min 0.5  [get_ports {req_data[4]}]
set_input_transition -max 0.5  [get_ports {req_data[3]}]
set_input_transition -min 0.5  [get_ports {req_data[3]}]
set_input_transition -max 0.5  [get_ports {req_data[2]}]
set_input_transition -min 0.5  [get_ports {req_data[2]}]
set_input_transition -max 0.5  [get_ports {req_data[1]}]
set_input_transition -min 0.5  [get_ports {req_data[1]}]
set_input_transition -max 0.5  [get_ports {req_data[0]}]
set_input_transition -min 0.5  [get_ports {req_data[0]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[255]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[255]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[254]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[254]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[253]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[253]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[252]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[252]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[251]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[251]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[250]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[250]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[249]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[249]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[248]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[248]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[247]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[247]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[246]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[246]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[245]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[245]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[244]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[244]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[243]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[243]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[242]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[242]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[241]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[241]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[240]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[240]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[239]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[239]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[238]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[238]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[237]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[237]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[236]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[236]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[235]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[235]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[234]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[234]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[233]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[233]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[232]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[232]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[231]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[231]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[230]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[230]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[229]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[229]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[228]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[228]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[227]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[227]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[226]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[226]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[225]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[225]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[224]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[224]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[223]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[223]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[222]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[222]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[221]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[221]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[220]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[220]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[219]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[219]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[218]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[218]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[217]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[217]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[216]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[216]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[215]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[215]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[214]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[214]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[213]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[213]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[212]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[212]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[211]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[211]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[210]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[210]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[209]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[209]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[208]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[208]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[207]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[207]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[206]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[206]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[205]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[205]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[204]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[204]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[203]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[203]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[202]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[202]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[201]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[201]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[200]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[200]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[199]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[199]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[198]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[198]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[197]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[197]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[196]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[196]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[195]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[195]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[194]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[194]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[193]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[193]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[192]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[192]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[191]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[191]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[190]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[190]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[189]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[189]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[188]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[188]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[187]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[187]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[186]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[186]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[185]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[185]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[184]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[184]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[183]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[183]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[182]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[182]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[181]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[181]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[180]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[180]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[179]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[179]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[178]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[178]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[177]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[177]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[176]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[176]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[175]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[175]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[174]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[174]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[173]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[173]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[172]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[172]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[171]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[171]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[170]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[170]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[169]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[169]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[168]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[168]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[167]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[167]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[166]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[166]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[165]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[165]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[164]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[164]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[163]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[163]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[162]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[162]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[161]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[161]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[160]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[160]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[159]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[159]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[158]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[158]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[157]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[157]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[156]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[156]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[155]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[155]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[154]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[154]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[153]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[153]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[152]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[152]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[151]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[151]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[150]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[150]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[149]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[149]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[148]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[148]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[147]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[147]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[146]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[146]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[145]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[145]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[144]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[144]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[143]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[143]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[142]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[142]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[141]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[141]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[140]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[140]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[139]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[139]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[138]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[138]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[137]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[137]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[136]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[136]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[135]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[135]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[134]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[134]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[133]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[133]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[132]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[132]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[131]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[131]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[130]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[130]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[129]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[129]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[128]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[128]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[127]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[127]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[126]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[126]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[125]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[125]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[124]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[124]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[123]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[123]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[122]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[122]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[121]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[121]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[120]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[120]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[119]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[119]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[118]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[118]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[117]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[117]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[116]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[116]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[115]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[115]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[114]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[114]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[113]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[113]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[112]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[112]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[111]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[111]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[110]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[110]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[109]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[109]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[108]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[108]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[107]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[107]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[106]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[106]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[105]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[105]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[104]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[104]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[103]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[103]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[102]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[102]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[101]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[101]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[100]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[100]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[99]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[99]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[98]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[98]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[97]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[97]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[96]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[96]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[95]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[95]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[94]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[94]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[93]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[93]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[92]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[92]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[91]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[91]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[90]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[90]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[89]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[89]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[88]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[88]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[87]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[87]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[86]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[86]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[85]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[85]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[84]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[84]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[83]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[83]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[82]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[82]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[81]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[81]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[80]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[80]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[79]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[79]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[78]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[78]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[77]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[77]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[76]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[76]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[75]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[75]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[74]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[74]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[73]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[73]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[72]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[72]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[71]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[71]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[70]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[70]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[69]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[69]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[68]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[68]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[67]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[67]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[66]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[66]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[65]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[65]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[64]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[64]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[63]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[63]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[62]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[62]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[61]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[61]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[60]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[60]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[59]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[59]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[58]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[58]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[57]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[57]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[56]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[56]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[55]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[55]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[54]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[54]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[53]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[53]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[52]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[52]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[51]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[51]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[50]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[50]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[49]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[49]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[48]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[48]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[47]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[47]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[46]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[46]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[45]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[45]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[44]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[44]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[43]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[43]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[42]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[42]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[41]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[41]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[40]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[40]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[39]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[39]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[38]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[38]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[37]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[37]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[36]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[36]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[35]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[35]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[34]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[34]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[33]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[33]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[32]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[32]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[31]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[31]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[30]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[30]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[29]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[29]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[28]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[28]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[27]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[27]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[26]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[26]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[25]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[25]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[24]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[24]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[23]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[23]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[22]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[22]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[21]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[21]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[20]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[20]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[19]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[19]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[18]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[18]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[17]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[17]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[16]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[16]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[15]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[15]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[14]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[14]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[13]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[13]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[12]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[12]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[11]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[11]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[10]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[10]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[9]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[9]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[8]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[8]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[7]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[7]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[6]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[6]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[5]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[5]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[4]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[4]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[3]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[3]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[2]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[2]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[1]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[1]}]
set_input_transition -max 0.5  [get_ports {DRAM_data[0]}]
set_input_transition -min 0.5  [get_ports {DRAM_data[0]}]
set_input_transition -max 0.5  [get_ports src_A_RD_pass]
set_input_transition -min 0.5  [get_ports src_A_RD_pass]
set_input_transition -max 0.5  [get_ports src_B_RD_pass]
set_input_transition -min 0.5  [get_ports src_B_RD_pass]
set_input_transition -max 0.5  [get_ports dst_C_WR_pass]
set_input_transition -min 0.5  [get_ports dst_C_WR_pass]
set_input_transition -max 0.5  [get_ports req_MM_vecA_write]
set_input_transition -min 0.5  [get_ports req_MM_vecA_write]
set_input_transition -max 0.5  [get_ports {bank_config[27]}]
set_input_transition -min 0.5  [get_ports {bank_config[27]}]
set_input_transition -max 0.5  [get_ports {bank_config[26]}]
set_input_transition -min 0.5  [get_ports {bank_config[26]}]
set_input_transition -max 0.5  [get_ports {bank_config[25]}]
set_input_transition -min 0.5  [get_ports {bank_config[25]}]
set_input_transition -max 0.5  [get_ports {bank_config[24]}]
set_input_transition -min 0.5  [get_ports {bank_config[24]}]
set_input_transition -max 0.5  [get_ports {bank_config[23]}]
set_input_transition -min 0.5  [get_ports {bank_config[23]}]
set_input_transition -max 0.5  [get_ports {bank_config[22]}]
set_input_transition -min 0.5  [get_ports {bank_config[22]}]
set_input_transition -max 0.5  [get_ports {bank_config[21]}]
set_input_transition -min 0.5  [get_ports {bank_config[21]}]
set_input_transition -max 0.5  [get_ports {bank_config[20]}]
set_input_transition -min 0.5  [get_ports {bank_config[20]}]
set_input_transition -max 0.5  [get_ports {bank_config[19]}]
set_input_transition -min 0.5  [get_ports {bank_config[19]}]
set_input_transition -max 0.5  [get_ports {bank_config[18]}]
set_input_transition -min 0.5  [get_ports {bank_config[18]}]
set_input_transition -max 0.5  [get_ports {bank_config[17]}]
set_input_transition -min 0.5  [get_ports {bank_config[17]}]
set_input_transition -max 0.5  [get_ports {bank_config[16]}]
set_input_transition -min 0.5  [get_ports {bank_config[16]}]
set_input_transition -max 0.5  [get_ports {bank_config[15]}]
set_input_transition -min 0.5  [get_ports {bank_config[15]}]
set_input_transition -max 0.5  [get_ports {bank_config[14]}]
set_input_transition -min 0.5  [get_ports {bank_config[14]}]
set_input_transition -max 0.5  [get_ports {bank_config[13]}]
set_input_transition -min 0.5  [get_ports {bank_config[13]}]
set_input_transition -max 0.5  [get_ports {bank_config[12]}]
set_input_transition -min 0.5  [get_ports {bank_config[12]}]
set_input_transition -max 0.5  [get_ports {bank_config[11]}]
set_input_transition -min 0.5  [get_ports {bank_config[11]}]
set_input_transition -max 0.5  [get_ports {bank_config[10]}]
set_input_transition -min 0.5  [get_ports {bank_config[10]}]
set_input_transition -max 0.5  [get_ports {bank_config[9]}]
set_input_transition -min 0.5  [get_ports {bank_config[9]}]
set_input_transition -max 0.5  [get_ports {bank_config[8]}]
set_input_transition -min 0.5  [get_ports {bank_config[8]}]
set_input_transition -max 0.5  [get_ports {bank_config[7]}]
set_input_transition -min 0.5  [get_ports {bank_config[7]}]
set_input_transition -max 0.5  [get_ports {bank_config[6]}]
set_input_transition -min 0.5  [get_ports {bank_config[6]}]
set_input_transition -max 0.5  [get_ports {bank_config[5]}]
set_input_transition -min 0.5  [get_ports {bank_config[5]}]
set_input_transition -max 0.5  [get_ports {bank_config[4]}]
set_input_transition -min 0.5  [get_ports {bank_config[4]}]
set_input_transition -max 0.5  [get_ports {bank_config[3]}]
set_input_transition -min 0.5  [get_ports {bank_config[3]}]
set_input_transition -max 0.5  [get_ports {bank_config[2]}]
set_input_transition -min 0.5  [get_ports {bank_config[2]}]
set_input_transition -max 0.5  [get_ports {bank_config[1]}]
set_input_transition -min 0.5  [get_ports {bank_config[1]}]
set_input_transition -max 0.5  [get_ports {bank_config[0]}]
set_input_transition -min 0.5  [get_ports {bank_config[0]}]
